app/views/pages/home.html.erb

SELECT COUNT(*) FROM "users"
---
<% if current_user.admin? %>
You are a  [<%= current_user.role %>] There are total <%= User.count %> users in the system